# Красивое лучше уродливого.
# Явное лучше неявного.
# Простое лучше сложного.
# Сложное лучше запутанного.
# Развернутое лучше вложенного.
# Разряженное лучше плотного.
# Читаемость имеет значение.
# Особые случаи не настолько особые, чтобы нарушать правила.
# При этом практичность важнее безупречности.
# Ошибки не должны замалчиваться.
# Если не замалчиваются явно.
# Встретив двусмысленность, отбрось  искушение угадать.
# Должен существовать один — и, желательно, только один — очевидный способ сделать что-то.
# Хотя этот способ поначалу может быть и не очевиден, если вы не голландец.
# Сейчас лучше, чем никогда.
# Хотя никогда часто лучше, чем *прямо* сейчас.
# Если реализацию сложно объяснить — идея точно плоха.
# Если реализацию легко объяснить — возможно, идея хороша.
# Пространства имен — отличная штука! Будем использовать их чаще!
